Repository: rhuitl/uClinux
Catalog: lib/libidn/po/*.po
Languages: fr

source: %s: Only one of -s, -e, -d, -a or -u can be specified.
fr: %s: une seule option parmi -s, -e, -d, -a ou -u peut être spécifiée.

source: Charset `%s'.
fr: Jeu de caractères `%s'.

source: Type each input string on a line by itself, terminated by a newline character.
fr: Tapez chaque chaque chaîne sur une seule ligne terminée par un retour de chariot.

source: %s: fgets() failed:
fr: %s: fgets() a échoué:

source: %s: could not convert from %s to UTF-8.
fr: %s: ne peut effectuer la conversion à partir de %s vers UTF-8.

source: %s: could not convert from UTF-8 to UCS-4.
fr: %s: ne peut effectuer la conversion à partir de UTF-8 vers UCS-4.

source: input[%d] = U+%04x
fr: entrée[%d] = U+%04x

source: %s: stringprep_profile() failed with error %d.
fr: %s: stringprep_profile() a échoué avec l'erreur %d.

source: output[%d] = U+%04x
fr: sortie[%d] = U+%04x

source: %s: could not convert from UTF-8 to %s.
fr: %s: ne peut effectuer la conversion à partir de UTF-8 vers %s.

source: %s: punycode_encode() failed with error %d.
fr: %s: punycode_encode() a échoué avec l'erreur %d.

source: %s: malloc() failed:
fr: %s: malloc() a échoué:

source: %s: punycode_decode() failed with error %d.
fr: %s: punycode_decode() a échoué avec l'erreur %d.

source: %s: could not convert from UCS-4 to UTF-8.
fr: %s: ne peut effectuer la conversion à partir de UCS-4 vers UTF-8.

source: %s: idna_to_ascii_4z() failed with error %d.
fr: %s: idna_to_ascii_4z() a échoué avec l'erreur %d.

source: %s: TLD idna_to_unicode_8z8z() failed with error %d.
fr: %s: TLD idna_to_unicode_8z8z() a échoué avec l'erreur %d.

source: %s: string rejected by TLD test (Unicode position %d)
fr: %s: chaîne rejeté par TLD test (Unicode position %d)

source: %s: tld_check_4z failed with error %d.
fr: %s: tld_check_4z a échoué avec l'erreur %d.

source: %s: idna_to_unicode_8z4z() failed with error %d.
fr: %s: idna_to_unicode_8z4z() a échoué avec l'erreur %d.
